fun countHieroglyphs(stringToTake: String): Int {
    val stringWithoutWhitespace = stringToTake.replace("\\s".toRegex(), "")
    val stringWithoutSpecialChars = stringWithoutWhitespace.replace("[$。，~：.《》“、”一—1234-560…•⠀-]".toRegex(), "")
    println(stringWithoutSpecialChars)
    return stringWithoutSpecialChars.length
}
fun main(){
    println(countHieroglyphs("""一部传记电影，带我们回到公元前 501 年的时代，回到古代中国，那里有战争和统治者之间的权力分配。 孔子本人是中国的圣哲和哲学家，一句话，是一位伟大的老师。 时至今日，孔子的教诲仍未被遗忘，他的言论与今天息息相关。 多少个时代过去了，他的教诲并没有失去意义。 他是一个多么伟大的人。 
 总的来说，“儒家”不仅是一种哲学，还包括一套精神和社会规范。 他的作品不仅适合中国，也适合全世界，尤其适合每个人。 这部电影导演传达的很好，演员的专业性只是补充了情节，一起变成了杰作。 
 影片中的男主角周润发完全适应了这个角色，结果孔子变得难以置信。 演员们演得很好。 事实证明，这部电影非常壮观，令人难忘。 一部关于善良、关于人类道德和价值观的电影，在上个世纪被如此重视，现在你可能找不到这样的东西了。
 但最重要的是，在电影中，我被大自然打动了。 美到什么地步……简直无法形容，你只需要看一场电影就能获得极大的乐趣。 整部电影都使用了非常优美的音乐。
 我从电影中学到的最重要的东西

 三件事一去不复返——时间、话语、机会。
 因此：不要浪费时间，选择的话，不要错过机会。
 ~ • ~

 事实证明，这部电影的深度和灵性都很美。 看完之后，你一定会去寻找这位伟人的名言。
 ⠀
 他的人格尺度是巨大的——他创立了儒家，首先开办了大学，将中国古代所有分散的知识系统化。  ⠀
 他有大约3000人，其中只有26人是他最亲近的学生。
 ⠀
 他的态度基于：
 ⠀
 1. “人性” - 一个人是他对自己的看法。
 2.《正义》
 3.“自定义”
 4. “智慧” - 计算他们行为的后果的能力，从外部和角度看待他们的能力。
 5、“诚”——从容不迫，尽职尽责。
 ⠀
 回到电影。 被思想者的精神力量所打动，无论如何，他都沿着自己选择的道路走到了尽头。

 我觉得大家应该看看电影《孔子》，让大家自己得出结论，说不定以后会有更多的好人。"""))
}
